<a href="https://colab.research.google.com/github/Arjun-coder5/Python-Data-science-library/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# ***Pandas Start***

**import pandas**

In [2]:
import pandas as pd
import numpy as np

# Series from List :

In [4]:
# String
country = ['India','pak','USA','Nepal','ShriLanka']
pd.Series(country)

0        India
1          pak
2          USA
3        Nepal
4    ShriLanka
dtype: object

In [5]:
# Integer :
runs = [13,12,24,56,78,100]
pd.Series(runs)

0     13
1     12
2     24
3     56
4     78
5    100
dtype: int64

In [9]:
# Custom index :
marks = [45,34,23,45]
subject = ['maths','science','english','social']
pd.Series(marks,index= subject)

maths      45
science    34
english    23
social     45
dtype: int64

In [13]:
# Setting a Name :
marks  =pd.Series(marks,index= subject , name  = "Marks")
marks

maths      45
science    34
english    23
social     45
Name: Marks, dtype: int64

# ***Series from Dict :***

In [15]:
marks = {
    'maths' : 83,
    'english' :93,
    'Science' : 92
}

marks_series = pd.Series(marks,name = 'Marks')
marks_series

maths      83
english    93
Science    92
Name: Marks, dtype: int64

# ***Series Attributes :***

In [17]:
# Size :
marks_series.size

3

In [18]:
# dtype :
marks_series.dtype

dtype('int64')

In [19]:
# name :
marks_series.name

'Marks'

In [26]:
# is_unique :
# marks_series.is_unique
pd.Series([1,1,1,1]).is_unique

False

In [27]:
# index :
marks_series.index

Index(['maths', 'english', 'Science'], dtype='object')

In [28]:
# value :
marks_series.values

array([83, 93, 92])

Series